app/controllers/api/availability_controller.rb

  def schedules
    schedules = @owner.availability_schedules.order(:created_at)
    render json: schedules.map { |s| schedule_json(s) }
---
SELECT "availability_schedules".* FROM "availability_schedules" WHERE "availability_schedules"."owner_id" = ? ORDER BY "availability_schedules"."created_at" ASC  [["owner_id", 1]]

  def exceptions
    exceptions = @owner.availability_exceptions
                        .where("date >= ?", Date.today)
                        .order(:date)
    render json: exceptions.map { |e| exception_json(e) }
---
SELECT "availability_exceptions".* FROM "availability_exceptions" WHERE "availability_exceptions"."owner_id" = ? AND (date >= ?) ORDER BY "availability_exceptions"."date" ASC  [["owner_id", 1], [nil, "2026-04-14"]]