app/controllers/api/available_slots_controller.rb

  def index
    event_id = params[:event_id]
    date = params[:date]

    if event_id.blank? || date.blank?
      render json: { error: "event_id and date are required" }, status: :bad_request
      return
    end

    event = Event.find(event_id)
    owner = event.owner
    requested_date = Date.parse(date)

    # Check availability for this date
    availability = owner.availability_for(requested_date)

    available_slots = case availability[:type]
    when :exception
                        handle_exception_availability(availability[:data], event, requested_date)
    when :schedule
                        handle_schedule_availability(availability[:data], event, requested_date)
    end

    # Get occupied slots from bookings
    occupied_slots = Booking.where(event_id: event_id)
                           .where("DATE(slot) = ?", date)
                           .pluck(:slot)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookings"."slot" FROM "bookings" WHERE "bookings"."event_id" = ? AND (DATE(slot) = ?)  [["event_id", 19], [nil, "2026-04-15"]]