app/controllers/api/bookings_controller.rb

  def index
    bookings = Booking.includes(:event)

    # Apply filters
    if params[:status].present?
      bookings = bookings.where(status: params[:status])
    end

    if params[:event_id].present?
      bookings = bookings.where(event_id: params[:event_id])
    end

    if params[:from_date].present? && params[:to_date].present?
      bookings = bookings.where(slot: params[:from_date]..params[:to_date])
    elsif params[:from_date].present?
      bookings = bookings.where("slot >= ?", params[:from_date])
---
SELECT "events".* FROM "events" WHERE "events"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 5]]
SELECT "bookings".* FROM "bookings"
SELECT "events".* FROM "events" WHERE "events"."id" = ?  [["id", 1]]

  def create
    @booking = Booking.new(booking_params)

    if @booking.save
---
INSERT INTO "bookings" ("event_id", "slot", "created_at", "updated_at", "guest_name", "guest_email", "guest_phone", "notes", "status", "location_type", "location_url", "guests_count", "cancelled_at", "cancellation_reason", "rescheduled_from", "custom_fields") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 980190962]]