app/controllers/api/events_controller.rb

INSERT INTO "events" ("name", "description", "duration", "created_at", "updated_at", "owner_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Test Event"], ["description", "A test"], ["duration", 30], ["created_at", "2026-04-05 11:43:12.275309"], ["updated_at", "2026-04-05 11:43:12.275309"], ["owner_id", 298486374]]
---
  def create
    @event = Event.new(event_params)
    @event.owner = Owner.predefined_owner

    if @event.save