app/controllers/api/owner_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."event_id" = ?  [["event_id", 2]]
SELECT "events".* FROM "events" WHERE "events"."owner_id" = ?  [["owner_id", 1]]
SELECT "bookings".* FROM "bookings" INNER JOIN "events" ON "bookings"."event_id" = "events"."id" WHERE "events"."owner_id" = ? ORDER BY "bookings"."slot" ASC  [["owner_id", 1]]
---
  def dashboard
    @events = @owner.events.includes(:bookings)
    @all_bookings = @owner.bookings.includes(:event).order(:slot)

INSERT INTO "events" ("name", "description", "duration", "created_at", "updated_at", "owner_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Тест API 2"], ["description", "Проверка CSRF фикса"], ["duration", 30], ["created_at", "2026-04-07 13:45:15.769145"], ["updated_at", "2026-04-07 13:45:15.769145"], ["owner_id", 1]]
---
  def create_event
    @event = Event.new(event_params)
    @event.owner = @owner

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."owner_id" = ? AND "events"."id" = ? LIMIT ?  [["owner_id", 1], ["id", 7], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 7]]
---
  def delete_event
    @event = @owner.events.find(params[:id])
    @event.destroy

SELECT "events".* FROM "events" WHERE "events"."id" IN (?, ?)  [["id", 2], ["id", 5]]
SELECT "bookings".* FROM "bookings" INNER JOIN "events" ON "bookings"."event_id" = "events"."id" WHERE "events"."owner_id" = ? ORDER BY "bookings"."slot" ASC  [["owner_id", 1]]
---
  def bookings
    @bookings = @owner.bookings.includes(:event).order(:slot)