app/controllers/api/public_controller.rb

  def events
    @events = Event.all.includes(:owner)
---
SELECT "owners".* FROM "owners" ORDER BY "owners"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."owner_id" = ?  [["owner_id", 1]]

  def event
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_booking
    @booking = Booking.new(booking_params)

    if @booking.save
---
INSERT INTO "bookings" ("event_id", "slot", "created_at", "updated_at", "guest_name", "guest_email", "guest_phone", "notes", "status", "location_type", "location_url", "guests_count", "cancelled_at", "cancellation_reason", "rescheduled_from", "custom_fields") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_owner
    @owner = Owner.find_by(slug: params[:slug])
---
SELECT "owners".* FROM "owners" WHERE "owners"."slug" = ? LIMIT ?  [["slug", "calendar-owner"], ["LIMIT", 1]]