app/views/booking_mailer/booking_created_owner.html.erb


    <p>Всего бронирований на этот слот: <%= Booking.where(slot: @booking.slot).count %></p>
---
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."slot" = ?  [["slot", "2026-04-20 14:00:00"]]