app/models/availability_schedule.rb

  def self.create_default_for(owner)
---
INSERT INTO "availability_schedules" ("owner_id", "name", "is_default", "schedule", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_default_if_needed
    if is_default && owner
      # Ensure only one default schedule per owner
      owner.availability_schedules.where.not(id: id).update_all(is_default: false)
---
UPDATE "availability_schedules" SET "is_default" = ? WHERE "availability_schedules"."owner_id" = ? AND "availability_schedules"."id" IS NOT NULL  [["is_default", 0], ["owner_id", 1]]