app/models/booking.rb

  scope :upcoming, -> { where("slot > ?", Time.now).where.not(status: "cancelled") }
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."slot" = ? AND "bookings"."id" IS NOT NULL ORDER BY "bookings"."id" ASC LIMIT ?  [["slot", "2026-04-05 00:00:00"], ["LIMIT", 1]]

  def slot_not_booked
    # Skip validation for cancelled bookings being moved
    return if status == "cancelled"

    existing_booking = Booking.where(slot: slot)
                             .where.not(id: id)
                             .where.not(status: "cancelled")
                             .first
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."slot" = ? AND "bookings"."id" IS NOT NULL AND "bookings"."status" != ? ORDER BY "bookings"."id" ASC LIMIT ?  [["slot", "2026-04-20 14:00:00"], ["status", "cancelled"], ["LIMIT", 1]]