app/models/owner.rb

SELECT "owners".* FROM "owners" ORDER BY "owners"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def generate_slug!
    return if slug.present?

SELECT "owners".* FROM "owners" ORDER BY "owners"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.predefined_owner
    owner = first_or_create!(
      name: "Default Owner",
      email: "owner@example.com"
    )
    owner.generate_slug! if owner.slug.blank?